For reference, I am not able to reproduce the issue using Terraform v1.6.3 and the AWS Provider v.5.31.0. This is the Terraform config I used:

```tf
resource "aws_servicequotas_service_quota" "example" {
  quota_code   = "L-FB94F0B0"
  service_code = "acm"
  value        = 20
}
```

And this is the output from my command prompt - the first `apply` created the resource and the quota request, and the subsequent `apply` did not detect any changes.

```tf
C:\working\test>terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_servicequotas_service_quota.example will be created
  + resource "aws_servicequotas_service_quota" "example" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-FB94F0B0"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "acm"
      + service_name   = (known after apply)
      + usage_metric   = (known after apply)
      + value          = 20
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_servicequotas_service_quota.example: Creating...
aws_servicequotas_service_quota.example: Creation complete after 1s [id=acm/L-FB94F0B0]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

C:\working\test>terraform apply
aws_servicequotas_service_quota.example: Refreshing state... [id=acm/L-FB94F0B0]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are
needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

C:\working\test>
```